SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_lcd.h
/* Bit fields for LCD IEN */
#define _LCD_IEN_RESETVALUE                     0x00000000UL                            /**< Default value for LCD_IEN                   */
#define _LCD_IEN_MASK                           0x00000007UL                            /**< Mask for LCD_IEN                            */
#define LCD_IEN_FC                              (0x1UL << 0)                            /**< Frame Counter                               */
#define _LCD_IEN_FC_SHIFT                       0                                       /**< Shift value for LCD_FC                      */
#define _LCD_IEN_FC_MASK                        0x1UL                                   /**< Bit mask for LCD_FC                         */
#define _LCD_IEN_FC_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for LCD_IEN                    */
#define LCD_IEN_FC_DEFAULT                      (_LCD_IEN_FC_DEFAULT << 0)              /**< Shifted mode DEFAULT for LCD_IEN            */
#define LCD_IEN_DISPLAY                         (0x1UL << 1)                            /**< Display Update Event                        */
#define _LCD_IEN_DISPLAY_SHIFT                  1                                       /**< Shift value for LCD_DISPLAY                 */
#define _LCD_IEN_DISPLAY_MASK                   0x2UL                                   /**< Bit mask for LCD_DISPLAY                    */
#define _LCD_IEN_DISPLAY_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_IEN                    */
#define LCD_IEN_DISPLAY_DEFAULT                 (_LCD_IEN_DISPLAY_DEFAULT << 1)         /**< Shifted mode DEFAULT for LCD_IEN            */
#define LCD_IEN_SYNCBUSYDONE                    (0x1UL << 2)                            /**< Sync Busy Done                              */
#define _LCD_IEN_SYNCBUSYDONE_SHIFT             2                                       /**< Shift value for LCD_SYNCBUSYDONE            */
#define _LCD_IEN_SYNCBUSYDONE_MASK              0x4UL                                   /**< Bit mask for LCD_SYNCBUSYDONE               */
#define _LCD_IEN_SYNCBUSYDONE_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LCD_IEN                    */
#define LCD_IEN_SYNCBUSYDONE_DEFAULT            (_LCD_IEN_SYNCBUSYDONE_DEFAULT << 2)    /**< Shifted mode DEFAULT for LCD_IEN            */

/* Bit fields for LCD BIASCTRL */
#define _LCD_BIASCTRL_RESETVALUE                0x001F0000UL                            /**< Default value for LCD_BIASCTRL              */
#define _LCD_BIASCTRL_MASK                      0xC45F137FUL                            /**< Mask for LCD_BIASCTRL                       */
#define _LCD_BIASCTRL_RESISTOR_SHIFT            0                                       /**< Shift value for LCD_RESISTOR                */
#define _LCD_BIASCTRL_RESISTOR_MASK             0xFUL                                   /**< Bit mask for LCD_RESISTOR                   */
#define _LCD_BIASCTRL_RESISTOR_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define LCD_BIASCTRL_RESISTOR_DEFAULT           (_LCD_BIASCTRL_RESISTOR_DEFAULT << 0)   /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define _LCD_BIASCTRL_BUFDRV_SHIFT              4                                       /**< Shift value for LCD_BUFDRV                  */
#define _LCD_BIASCTRL_BUFDRV_MASK               0x70UL                                  /**< Bit mask for LCD_BUFDRV                     */
#define _LCD_BIASCTRL_BUFDRV_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define LCD_BIASCTRL_BUFDRV_DEFAULT             (_LCD_BIASCTRL_BUFDRV_DEFAULT << 4)     /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define _LCD_BIASCTRL_BUFBIAS_SHIFT             8                                       /**< Shift value for LCD_BUFBIAS                 */
#define _LCD_BIASCTRL_BUFBIAS_MASK              0x300UL                                 /**< Bit mask for LCD_BUFBIAS                    */
#define _LCD_BIASCTRL_BUFBIAS_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define LCD_BIASCTRL_BUFBIAS_DEFAULT            (_LCD_BIASCTRL_BUFBIAS_DEFAULT << 8)    /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define LCD_BIASCTRL_MODE                       (0x1UL << 12)                           /**< Mode Setting                                */
#define _LCD_BIASCTRL_MODE_SHIFT                12                                      /**< Shift value for LCD_MODE                    */
#define _LCD_BIASCTRL_MODE_MASK                 0x1000UL                                /**< Bit mask for LCD_MODE                       */
#define _LCD_BIASCTRL_MODE_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define _LCD_BIASCTRL_MODE_STEPDOWN             0x00000000UL                            /**< Mode STEPDOWN for LCD_BIASCTRL              */
#define _LCD_BIASCTRL_MODE_CHARGEPUMP           0x00000001UL                            /**< Mode CHARGEPUMP for LCD_BIASCTRL            */
#define LCD_BIASCTRL_MODE_DEFAULT               (_LCD_BIASCTRL_MODE_DEFAULT << 12)      /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define LCD_BIASCTRL_MODE_STEPDOWN              (_LCD_BIASCTRL_MODE_STEPDOWN << 12)     /**< Shifted mode STEPDOWN for LCD_BIASCTRL      */
#define LCD_BIASCTRL_MODE_CHARGEPUMP            (_LCD_BIASCTRL_MODE_CHARGEPUMP << 12)   /**< Shifted mode CHARGEPUMP for LCD_BIASCTRL    */
#define _LCD_BIASCTRL_VLCD_SHIFT                16                                      /**< Shift value for LCD_VLCD                    */
#define _LCD_BIASCTRL_VLCD_MASK                 0x1F0000UL                              /**< Bit mask for LCD_VLCD                       */
#define _LCD_BIASCTRL_VLCD_DEFAULT              0x0000001FUL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define LCD_BIASCTRL_VLCD_DEFAULT               (_LCD_BIASCTRL_VLCD_DEFAULT << 16)      /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define LCD_BIASCTRL_VDDXSEL                    (0x1UL << 22)                           /**< VDDX select                                 */
#define _LCD_BIASCTRL_VDDXSEL_SHIFT             22                                      /**< Shift value for LCD_VDDXSEL                 */
#define _LCD_BIASCTRL_VDDXSEL_MASK              0x400000UL                              /**< Bit mask for LCD_VDDXSEL                    */
#define _LCD_BIASCTRL_VDDXSEL_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define _LCD_BIASCTRL_VDDXSEL_DVDD              0x00000000UL                            /**< Mode DVDD for LCD_BIASCTRL                  */
#define _LCD_BIASCTRL_VDDXSEL_AVDD              0x00000001UL                            /**< Mode AVDD for LCD_BIASCTRL                  */
#define LCD_BIASCTRL_VDDXSEL_DEFAULT            (_LCD_BIASCTRL_VDDXSEL_DEFAULT << 22)   /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define LCD_BIASCTRL_VDDXSEL_DVDD               (_LCD_BIASCTRL_VDDXSEL_DVDD << 22)      /**< Shifted mode DVDD for LCD_BIASCTRL          */
#define LCD_BIASCTRL_VDDXSEL_AVDD               (_LCD_BIASCTRL_VDDXSEL_AVDD << 22)      /**< Shifted mode AVDD for LCD_BIASCTRL          */
#define LCD_BIASCTRL_LCDGATE                    (0x1UL << 26)                           /**< LCD Gate                                    */
#define _LCD_BIASCTRL_LCDGATE_SHIFT             26                                      /**< Shift value for LCD_LCDGATE                 */
#define _LCD_BIASCTRL_LCDGATE_MASK              0x4000000UL                             /**< Bit mask for LCD_LCDGATE                    */
#define _LCD_BIASCTRL_LCDGATE_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define _LCD_BIASCTRL_LCDGATE_UNGATE            0x00000000UL                            /**< Mode UNGATE for LCD_BIASCTRL                */
#define _LCD_BIASCTRL_LCDGATE_GATE              0x00000001UL                            /**< Mode GATE for LCD_BIASCTRL                  */
#define LCD_BIASCTRL_LCDGATE_DEFAULT            (_LCD_BIASCTRL_LCDGATE_DEFAULT << 26)   /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define LCD_BIASCTRL_LCDGATE_UNGATE             (_LCD_BIASCTRL_LCDGATE_UNGATE << 26)    /**< Shifted mode UNGATE for LCD_BIASCTRL        */
#define LCD_BIASCTRL_LCDGATE_GATE               (_LCD_BIASCTRL_LCDGATE_GATE << 26)      /**< Shifted mode GATE for LCD_BIASCTRL          */
#define _LCD_BIASCTRL_DMAMODE_SHIFT             30                                      /**< Shift value for LCD_DMAMODE                 */
#define _LCD_BIASCTRL_DMAMODE_MASK              0xC0000000UL                            /**< Bit mask for LCD_DMAMODE                    */
#define _LCD_BIASCTRL_DMAMODE_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LCD_BIASCTRL               */
#define _LCD_BIASCTRL_DMAMODE_DMADISABLE        0x00000000UL                            /**< Mode DMADISABLE for LCD_BIASCTRL            */
#define _LCD_BIASCTRL_DMAMODE_DMAFC             0x00000001UL                            /**< Mode DMAFC for LCD_BIASCTRL                 */
#define _LCD_BIASCTRL_DMAMODE_DMADISPLAY        0x00000002UL                            /**< Mode DMADISPLAY for LCD_BIASCTRL            */
#define LCD_BIASCTRL_DMAMODE_DEFAULT            (_LCD_BIASCTRL_DMAMODE_DEFAULT << 30)   /**< Shifted mode DEFAULT for LCD_BIASCTRL       */
#define LCD_BIASCTRL_DMAMODE_DMADISABLE         (_LCD_BIASCTRL_DMAMODE_DMADISABLE << 30) /**< Shifted mode DMADISABLE for LCD_BIASCTRL    */
#define LCD_BIASCTRL_DMAMODE_DMAFC              (_LCD_BIASCTRL_DMAMODE_DMAFC << 30)     /**< Shifted mode DMAFC for LCD_BIASCTRL         */
#define LCD_BIASCTRL_DMAMODE_DMADISPLAY         (_LCD_BIASCTRL_DMAMODE_DMADISPLAY << 30) /**< Shifted mode DMADISPLAY for LCD_BIASCTRL    */

/* Bit fields for LCD DISPCTRLX */
#define _LCD_DISPCTRLX_RESETVALUE               0x00000000UL                            /**< Default value for LCD_DISPCTRLX             */
#define _LCD_DISPCTRLX_MASK                     0x000003FFUL                            /**< Mask for LCD_DISPCTRLX                      */
#define _LCD_DISPCTRLX_DISPLAYDIV_SHIFT         0                                       /**< Shift value for LCD_DISPLAYDIV              */
#define _LCD_DISPCTRLX_DISPLAYDIV_MASK          0x3FFUL                                 /**< Bit mask for LCD_DISPLAYDIV                 */
#define _LCD_DISPCTRLX_DISPLAYDIV_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LCD_DISPCTRLX              */
#define LCD_DISPCTRLX_DISPLAYDIV_DEFAULT        (_LCD_DISPCTRLX_DISPLAYDIV_DEFAULT << 0) /**< Shifted mode DEFAULT for LCD_DISPCTRLX      */

/* Bit fields for LCD SEGD0 */
#define _LCD_SEGD0_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD0                 */
#define _LCD_SEGD0_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD0                          */
#define _LCD_SEGD0_SEGD0_SHIFT                  0                                       /**< Shift value for LCD_SEGD0                   */
#define _LCD_SEGD0_SEGD0_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD0                      */
#define _LCD_SEGD0_SEGD0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD0                  */
#define LCD_SEGD0_SEGD0_DEFAULT                 (_LCD_SEGD0_SEGD0_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD0          */

/* Bit fields for LCD SEGD1 */
#define _LCD_SEGD1_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD1                 */
#define _LCD_SEGD1_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD1                          */
#define _LCD_SEGD1_SEGD1_SHIFT                  0                                       /**< Shift value for LCD_SEGD1                   */
#define _LCD_SEGD1_SEGD1_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD1                      */
#define _LCD_SEGD1_SEGD1_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD1                  */
#define LCD_SEGD1_SEGD1_DEFAULT                 (_LCD_SEGD1_SEGD1_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD1          */

