SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_lcd.h
/* Bit fields for LCD SEGD2 */
#define _LCD_SEGD2_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD2                 */
#define _LCD_SEGD2_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD2                          */
#define _LCD_SEGD2_SEGD2_SHIFT                  0                                       /**< Shift value for LCD_SEGD2                   */
#define _LCD_SEGD2_SEGD2_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD2                      */
#define _LCD_SEGD2_SEGD2_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD2                  */
#define LCD_SEGD2_SEGD2_DEFAULT                 (_LCD_SEGD2_SEGD2_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD2          */

/* Bit fields for LCD SEGD3 */
#define _LCD_SEGD3_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD3                 */
#define _LCD_SEGD3_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD3                          */
#define _LCD_SEGD3_SEGD3_SHIFT                  0                                       /**< Shift value for LCD_SEGD3                   */
#define _LCD_SEGD3_SEGD3_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD3                      */
#define _LCD_SEGD3_SEGD3_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD3                  */
#define LCD_SEGD3_SEGD3_DEFAULT                 (_LCD_SEGD3_SEGD3_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD3          */

/* Bit fields for LCD SEGD4 */
#define _LCD_SEGD4_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD4                 */
#define _LCD_SEGD4_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD4                          */
#define _LCD_SEGD4_SEGD4_SHIFT                  0                                       /**< Shift value for LCD_SEGD4                   */
#define _LCD_SEGD4_SEGD4_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD4                      */
#define _LCD_SEGD4_SEGD4_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD4                  */
#define LCD_SEGD4_SEGD4_DEFAULT                 (_LCD_SEGD4_SEGD4_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD4          */

/* Bit fields for LCD SEGD5 */
#define _LCD_SEGD5_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD5                 */
#define _LCD_SEGD5_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD5                          */
#define _LCD_SEGD5_SEGD5_SHIFT                  0                                       /**< Shift value for LCD_SEGD5                   */
#define _LCD_SEGD5_SEGD5_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD5                      */
#define _LCD_SEGD5_SEGD5_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD5                  */
#define LCD_SEGD5_SEGD5_DEFAULT                 (_LCD_SEGD5_SEGD5_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD5          */

/* Bit fields for LCD SEGD6 */
#define _LCD_SEGD6_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD6                 */
#define _LCD_SEGD6_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD6                          */
#define _LCD_SEGD6_SEGD6_SHIFT                  0                                       /**< Shift value for LCD_SEGD6                   */
#define _LCD_SEGD6_SEGD6_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD6                      */
#define _LCD_SEGD6_SEGD6_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD6                  */
#define LCD_SEGD6_SEGD6_DEFAULT                 (_LCD_SEGD6_SEGD6_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD6          */

/* Bit fields for LCD SEGD7 */
#define _LCD_SEGD7_RESETVALUE                   0x00000000UL                            /**< Default value for LCD_SEGD7                 */
#define _LCD_SEGD7_MASK                         0x0FFFFFFFUL                            /**< Mask for LCD_SEGD7                          */
#define _LCD_SEGD7_SEGD7_SHIFT                  0                                       /**< Shift value for LCD_SEGD7                   */
#define _LCD_SEGD7_SEGD7_MASK                   0xFFFFFFFUL                             /**< Bit mask for LCD_SEGD7                      */
#define _LCD_SEGD7_SEGD7_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LCD_SEGD7                  */
#define LCD_SEGD7_SEGD7_DEFAULT                 (_LCD_SEGD7_SEGD7_DEFAULT << 0)         /**< Shifted mode DEFAULT for LCD_SEGD7          */

/* Bit fields for LCD UPDATECTRL */
#define _LCD_UPDATECTRL_RESETVALUE              0x00000000UL                            /**< Default value for LCD_UPDATECTRL            */
#define _LCD_UPDATECTRL_MASK                    0x0001E100UL                            /**< Mask for LCD_UPDATECTRL                     */
#define LCD_UPDATECTRL_AUTOLOAD                 (0x1UL << 8)                            /**< Auto Load                                   */
#define _LCD_UPDATECTRL_AUTOLOAD_SHIFT          8                                       /**< Shift value for LCD_AUTOLOAD                */
#define _LCD_UPDATECTRL_AUTOLOAD_MASK           0x100UL                                 /**< Bit mask for LCD_AUTOLOAD                   */
#define _LCD_UPDATECTRL_AUTOLOAD_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LCD_UPDATECTRL             */
#define _LCD_UPDATECTRL_AUTOLOAD_MANUAL         0x00000000UL                            /**< Mode MANUAL for LCD_UPDATECTRL              */
#define _LCD_UPDATECTRL_AUTOLOAD_AUTO           0x00000001UL                            /**< Mode AUTO for LCD_UPDATECTRL                */
#define LCD_UPDATECTRL_AUTOLOAD_DEFAULT         (_LCD_UPDATECTRL_AUTOLOAD_DEFAULT << 8) /**< Shifted mode DEFAULT for LCD_UPDATECTRL     */
#define LCD_UPDATECTRL_AUTOLOAD_MANUAL          (_LCD_UPDATECTRL_AUTOLOAD_MANUAL << 8)  /**< Shifted mode MANUAL for LCD_UPDATECTRL      */
#define LCD_UPDATECTRL_AUTOLOAD_AUTO            (_LCD_UPDATECTRL_AUTOLOAD_AUTO << 8)    /**< Shifted mode AUTO for LCD_UPDATECTRL        */
#define _LCD_UPDATECTRL_LOADADDR_SHIFT          13                                      /**< Shift value for LCD_LOADADDR                */
#define _LCD_UPDATECTRL_LOADADDR_MASK           0x1E000UL                               /**< Bit mask for LCD_LOADADDR                   */
#define _LCD_UPDATECTRL_LOADADDR_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LCD_UPDATECTRL             */
#define _LCD_UPDATECTRL_LOADADDR_BACTRLWR       0x00000000UL                            /**< Mode BACTRLWR for LCD_UPDATECTRL            */
#define _LCD_UPDATECTRL_LOADADDR_AREGAWR        0x00000001UL                            /**< Mode AREGAWR for LCD_UPDATECTRL             */
#define _LCD_UPDATECTRL_LOADADDR_AREGBWR        0x00000002UL                            /**< Mode AREGBWR for LCD_UPDATECTRL             */
#define _LCD_UPDATECTRL_LOADADDR_SEGD0WR        0x00000003UL                            /**< Mode SEGD0WR for LCD_UPDATECTRL             */
#define _LCD_UPDATECTRL_LOADADDR_SEGD1WR        0x00000004UL                            /**< Mode SEGD1WR for LCD_UPDATECTRL             */
#define _LCD_UPDATECTRL_LOADADDR_SEGD2WR        0x00000005UL                            /**< Mode SEGD2WR for LCD_UPDATECTRL             */
#define _LCD_UPDATECTRL_LOADADDR_SEGD3WR        0x00000006UL                            /**< Mode SEGD3WR for LCD_UPDATECTRL             */
#define LCD_UPDATECTRL_LOADADDR_DEFAULT         (_LCD_UPDATECTRL_LOADADDR_DEFAULT << 13) /**< Shifted mode DEFAULT for LCD_UPDATECTRL     */
#define LCD_UPDATECTRL_LOADADDR_BACTRLWR        (_LCD_UPDATECTRL_LOADADDR_BACTRLWR << 13) /**< Shifted mode BACTRLWR for LCD_UPDATECTRL    */
#define LCD_UPDATECTRL_LOADADDR_AREGAWR         (_LCD_UPDATECTRL_LOADADDR_AREGAWR << 13) /**< Shifted mode AREGAWR for LCD_UPDATECTRL     */
#define LCD_UPDATECTRL_LOADADDR_AREGBWR         (_LCD_UPDATECTRL_LOADADDR_AREGBWR << 13) /**< Shifted mode AREGBWR for LCD_UPDATECTRL     */
#define LCD_UPDATECTRL_LOADADDR_SEGD0WR         (_LCD_UPDATECTRL_LOADADDR_SEGD0WR << 13) /**< Shifted mode SEGD0WR for LCD_UPDATECTRL     */
#define LCD_UPDATECTRL_LOADADDR_SEGD1WR         (_LCD_UPDATECTRL_LOADADDR_SEGD1WR << 13) /**< Shifted mode SEGD1WR for LCD_UPDATECTRL     */
#define LCD_UPDATECTRL_LOADADDR_SEGD2WR         (_LCD_UPDATECTRL_LOADADDR_SEGD2WR << 13) /**< Shifted mode SEGD2WR for LCD_UPDATECTRL     */
#define LCD_UPDATECTRL_LOADADDR_SEGD3WR         (_LCD_UPDATECTRL_LOADADDR_SEGD3WR << 13) /**< Shifted mode SEGD3WR for LCD_UPDATECTRL     */

/* Bit fields for LCD FRAMERATE */
#define _LCD_FRAMERATE_RESETVALUE               0x00000000UL                            /**< Default value for LCD_FRAMERATE             */
#define _LCD_FRAMERATE_MASK                     0x000001FFUL                            /**< Mask for LCD_FRAMERATE                      */
#define _LCD_FRAMERATE_FRDIV_SHIFT              0                                       /**< Shift value for LCD_FRDIV                   */
#define _LCD_FRAMERATE_FRDIV_MASK               0x1FFUL                                 /**< Bit mask for LCD_FRDIV                      */
#define _LCD_FRAMERATE_FRDIV_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LCD_FRAMERATE              */
#define LCD_FRAMERATE_FRDIV_DEFAULT             (_LCD_FRAMERATE_FRDIV_DEFAULT << 0)     /**< Shifted mode DEFAULT for LCD_FRAMERATE      */

/** @} End of group EFM32PG28_LCD_BitFields */
/** @} End of group EFM32PG28_LCD */
/** @} End of group Parts */

#endif // EFM32PG28_LCD_H
